Repository: TrustyJAID/Trusty-cogs
Catalog: extendedmodlog/locales/*.po
Languages: fr_fr

source: `{arg}` is not an available command permission.
fr_fr: `{arg}` n'est pas une permission de commande disponible.

source: `{arg}` is not an available event option.
fr_fr: `{arg}` n'est pas une option d'événement disponible.

source: Handles all the on_event data
fr_fr: Gère toutes les données relatives aux événements

source: Not Set MOD
fr_fr: Non défini MOD

source: Not Set ADMIN
fr_fr: Non défini ADMIN

source: {emoji} `{time}` {author}(`{a_id}`) used the following command in {channel} > {com}
fr_fr: {emoji} `{time}` {author}(a utilisé la commande suivante dans {} > {com}

source: Channel
fr_fr: Salon concerné

source: Can Run
fr_fr: Utilisable

source: Requires
fr_fr: Nécessite

source: Bot Requires
fr_fr: Le bot nécessite

source: {member} ({m_id})- Used a Command
fr_fr: Commande de modération | {member}

source: *Message's content unknown.*
fr_fr: *Contenu du message inconnu.*

source: Deleted Message
fr_fr: Message supprimé

source: {emoji} `{time}` A message was deleted in {channel}
fr_fr: {emoji} `{time}` Un message a été supprimé dans {}

source: {emoji} `{time}` A message from **{author}** (`{a_id}`) was deleted in {channel}
fr_fr: {emoji} `{time}` Un message de **{author}** a été supprimé dans {}

source: {emoji} `{time}` {perp} deleted a message from **{author}** (`{a_id}`) in {channel}
fr_fr: {emoji} `{time}` {perp} a supprimé un message de **{author}** dans {}

source: Deleted by
fr_fr: Supprimé par

source: Attachments
fr_fr: Pièces jointes

source: {member} ({m_id})- Deleted Message
fr_fr: {member} - Message supprimé

source: Bulk message delete
fr_fr: Serveur | Messages supprimés via clear

source: Messages deleted
fr_fr: Messages supprimés

source: {emoji} `{time}` Bulk message delete in {channel}, {amount} messages deleted.
fr_fr: {emoji} `{time}` Suppression des messages en masse dans {}, {amount} messages supprimés.

source: Added by: {inviter}
fr_fr: Ajouté par : {inviter}

source: https://discord.gg/{code} Invited by: {inviter}
fr_fr: https://discord.gg/{code} Invité par : {inviter}

source: Widget Integration
fr_fr: Intégration du widget

source: Unknown or deleted user ({inviter})
fr_fr: Utilisateur inconnu ou supprimé ({inviter})

source: Total Users:
fr_fr: Nombre total de membres :

source: Account created on:
fr_fr: Compte créé le :

source: {member} ({m_id}) has joined the guild
fr_fr: {member} a rejoint le serveur

source: Invite Link
fr_fr: Lien d'invitation

source: {emoji} `{time}` **{member}**(`{m_id}`) joined the guild. Total members: {users}
fr_fr: {emoji} `{time}` **{member}** a rejoint le serveur. Nombre total de membres: {users}

source: Kicked
fr_fr: Kick

source: Reason
fr_fr: Raison

source: {member} ({m_id}) has left the guild
fr_fr: {member} a quitté le serveur

source: {emoji} `{time}` **{member}**(`{m_id}`) left the guild. Total members: {users}
fr_fr: {emoji} `{time}` **{member}** a quitté le serveur. Nombre restants de membres :

source: {emoji} `{time}` **{member}**(`{m_id}`) was kicked by {perp}. Total members: {users}
fr_fr: {emoji} `{time}` **{member}** a été kick par {perp}. Nombre total de membres: {users}

source: {name} Removed overwrites.
fr_fr: {name} Suppression des précédents changements de permissions.

source: {name} Overwrites removed.
fr_fr: {name} Suppression des précédents changements de permissions.

source: {name} Updated overwrites.
fr_fr: {name} Permissions mises à jour.

source: {name} {perm} Set to {value}.
fr_fr: {name} {perm} Défini sur {value}.

source: {name} Added overwrites.
fr_fr: {name} Ajout de changement de permissions.

source: {name} Overwrites added.
fr_fr: {name} Changement de permissions effectué.

source: {chan_type} Channel Created {chan_name} ({chan_id})
fr_fr: Nouveau salon créé | {chan_name}

source: by {perp} (`{perp_id}`)
fr_fr: par {perp}

source: Created by
fr_fr: Créé par

source: Reason: {reason}
fr_fr: Motif : {reason}

source: Reason
fr_fr: Raison

source: {emoji} `{time}` {chan_type} channel created {perp_msg} {channel}
fr_fr: {emoji} `{time}` {chan_type} Salon créé {perp_msg} {channel}

source: {chan_type} Channel Deleted {chan_name} ({chan_id})
fr_fr: {emoji} `{time}` {chan_type} supprimé {perp_msg} {}

source: Deleted by
fr_fr: Supprimé par

source: {emoji} `{time}` {chan_type} channel deleted {perp_msg} {channel}
fr_fr: {emoji} `{time}` {chan_type} supprimé {perp_msg} {}

source: {chan_type} Channel Updated {chan_name} ({chan_id})
fr_fr: Salon mis à jour | {chan_name}

source: {emoji} `{time}` Updated channel {channel}
fr_fr: {emoji} `{time}` Salon mis à jour {}

source: Name:
fr_fr: Nom :

source: Topic:
fr_fr: Description :

source: Category:
fr_fr: Catégorie :

source: Slowmode delay:
fr_fr: Délai du mode lent :

source: Before
fr_fr: Précédent

source: After
fr_fr: Nouveau

source: Permissions Changed:
fr_fr: Permissions modifiées :

source: User limit:
fr_fr: Limite de membres :

source: Updated by
fr_fr: Mis à jour par :

source: {permission} Set to **{change}**
fr_fr: {permission} Définie sur {change}.

source: {emoji} `{time}` Updated role **{role}**
fr_fr: {emoji} `{time}` Role mis à jour **{role}**

source: Updated @everyone role
fr_fr: Rôle @everyone mis à jour

source: Updated {role} ({r_id}) role
fr_fr: Role {role} mis à jour

source: Colour:
fr_fr: Couleur :

source: Mentionable:
fr_fr: Mentionnable :

source: Is Hoisted:
fr_fr: Est levé :

source: Role created {role} ({r_id})
fr_fr: Role créé {role}

source: {emoji} `{time}` Role created {role}
fr_fr: {emoji} `{time}` Role créé {role}

source: Created by
fr_fr: Créé par

source: By
fr_fr: Par

source: Role deleted {role} ({r_id})
fr_fr: Role supprimé {role}

source: {emoji} `{time}` Role deleted **{role}**
fr_fr: {emoji} `{time}` Role supprimé **{role}**

source: After Message:
fr_fr: Message édité :

source: Channel:
fr_fr: Salon :

source: {member} ({m_id}) - Edited Message
fr_fr: Message édité | {member}

source: {emoji} `{time}` **{author}** (`{a_id}`) edited a message in {channel}. Before: > {before} After: > {after}
fr_fr: {emoji} `{time}` **{author}** a édité un message dans {}. Avant : > {before} Après : > {after}

source: Updated Guild
fr_fr: Mise à jour du serveur

source: {emoji} `{time}` Guild updated
fr_fr: {emoji} `{time}` Serveur mis à jour

source: Region:
fr_fr: Région :

source: AFK Channel:
fr_fr: Salon AFK :

source: Server Icon:
fr_fr: Logo du serveur :

source: Server Owner:
fr_fr: Propriétaire du serveur :

source: Splash Image:
fr_fr: Image de bienvenue :

source: Welcome message channel:
fr_fr: Salon des messages de bienvenue :

source: Verification Level:
fr_fr: Niveau de vérification :

source: Server Icon Updated
fr_fr: Logo du serveur mis à jour

source: Update by
fr_fr: Mise à jour par

source: Updated by
fr_fr: Mis à jour par

source: Reasons
fr_fr: Raisons

source: Updated Server Emojis
fr_fr: Serveur | Modification des emotes

source: {emoji} `{time}` Updated Server Emojis
fr_fr: {emoji} `{time}` Mise à jour des emotes

source: `{emoji_name}` (ID: {emoji_id}) Removed from the guild
fr_fr: `{emoji_name}` Retirée du serveur

source: {emoji} Added to the guild
fr_fr: {emoji} Ajoutée au serveur

source: {emoji} Renamed from {old_emoji_name} to {new_emoji_name}
fr_fr: {emoji} Renommé de {old_emoji_name} à {new_emoji_name}

source: {emoji} Changed to unrestricted.
fr_fr: {emoji} Changée en sans restriction.

source: {emoji} Restricted to roles: {roles}
fr_fr: {emoji} Restreint aux rôles : {roles}

source: {emoji} Role restriction changed from {old_roles} To {new_roles}
fr_fr: {emoji} La restriction de rôle est passée de {old_roles} À {new_roles}

source: {emoji} `{time}` Updated Voice State for **{member}** (`{m_id}`)
fr_fr: {emoji} `{time}` Mise à jour de l'état vocal de **{member}**

source: {member} ({m_id}) Voice State Update
fr_fr: Vocal | {member}

source: {member} was deafened.
fr_fr: {member} est désormais mute son.

source: {member} was undeafened.
fr_fr: {member} n'est plus mute son.

source: {member} was muted.
fr_fr: {member} est désormais mute.

source: {member} was unmuted.
fr_fr: {member} n'est plus mute.

source: {member} has joined {after_channel}
fr_fr: {member} a rejoint le salon vocal {after_channel}

source: {member} has left {before_channel}
fr_fr: {member} s'est déconnecté du salon vocal {before_channel}

source: {member} has moved from {before_channel} to {after_channel}
fr_fr: {member} s'est déplacé de {before_channel} vers {after_channel}

source: {emoji} `{time}` Member updated **{member}** (`{m_id}`)
fr_fr: {emoji} `{time}` Membre mis à jour **{member}**

source: {member} ({m_id}) updated
fr_fr: Profil mis à jour | {member}

source: Nickname:
fr_fr: Surnom :

source: {author} had the {role} role removed.
fr_fr: Rôle {role} retiré de son profil.

source: {author} had the {role} role removed.
fr_fr: {author} vient de se faire retirer le rôle {role}.

source: {author} had the {role} role applied.
fr_fr: Rôle {role} ajouté à son profil.

source: {author} had the {role} role applied.
fr_fr: {author} vient de se faire ajouter le rôle {role}.

source: {author} changed their nickname.
fr_fr: Nouveau surnom.

source: Reason:
fr_fr: Raison :

source: Code:
fr_fr: Code d'invitation :

source: Inviter:
fr_fr: Créateur :

source: Max Uses:
fr_fr: Utilisations Max :

source: Max Age:
fr_fr: Temps restant :

source: Temporary:
fr_fr: Temporaire :

source: {emoji} `{time}` Invite created
fr_fr: {emoji} `{time}` Invitation créée

source: Invite Created
fr_fr: Invitation Discord Créée

source: {author} created an invite for {channel}.
fr_fr: {author} a créé une invitation pour {}.

source: Code:
fr_fr: Code d'invitation :

source: Inviter:
fr_fr: Créateur :

source: Channel:
fr_fr: Salon :

source: Max Uses:
fr_fr: Utilisations Max :

source: Used:
fr_fr: Utilisée :

source: {emoji} `{time}` Invite deleted
fr_fr: {emoji} `{time}` Invitation supprimée

source: Invite Deleted
fr_fr: Serveur | Invitation Supprimée

source: {author} deleted or used up an invite for {channel}.
fr_fr: {author} a supprimé ou épuisé une invitation à {}.

source: Extended modlogs Works with core modlogset channel
fr_fr: Modlogs étendus Fonctionne avec le canal principal de modlogset

source: Not Set
fr_fr: Non défini

source: Message edits
fr_fr: Modifications des messages

source: Message delete
fr_fr: Suppression de message

source: Member changes
fr_fr: Changements parmi les membres

source: Role changes
fr_fr: Changement dans les rôles

source: Role created
fr_fr: Rôle créé

source: Role deleted
fr_fr: Rôle supprimé

source: Voice changes
fr_fr: Changements dans les vocaux

source: Member join
fr_fr: Nouveau Membre

source: Member left
fr_fr: Le membre a quitté

source: Channel changes
fr_fr: Modification d'un salon

source: Channel created
fr_fr: Salon créé

source: Channel deleted
fr_fr: Salon supprimé

source: Guild changes
fr_fr: Changement sur le serveur

source: Emoji changes
fr_fr: Changement sur les emotes

source: Commands
fr_fr: Commandes

source: Invite created
fr_fr: Invitation créée

source: Invite deleted
fr_fr: Inviter supprimée

source: Setting for {guild} Modlog Channel {channel}
fr_fr: Paramètres de {guild} Salon modlog utilisé : {channel}

source: None
fr_fr: Aucune

source: Ignored Channels
fr_fr: Salons ignorés

source: Toggle various extended modlog notifications Requires the channel to be setup with `[p]modlogset modlog #channel` Or can be sent to separate channels with `[p]modlog channel #channel event_name`
fr_fr: Activer/Désactiver les différentes notifications modlog Nécessite que le salon soit configuré avec `[p]modlogset modlog #` Ou peuvent être envoyés sur des salons séparés avec `[p]modlog # event_name`

source: Show the servers current ExtendedModlog settings
fr_fr: Afficher les paramètres actuels d'ExtendedModlog

source: Set custom colours for modlog events `colour` must be a hex code or a [built colour.](https://discordpy.readthedocs.io/en/latest/api.html#colour) `[events...]` must be any of the following options (more than one event can be provided at once): `channel_change` - Updates to channel name, etc. `channel_create` `channel_delete` `commands_used` - Bot command usage `emoji_change` - Emojis added or deleted `guild_change` - Server settings changed `message_edit` `message_delete` `member_change` - Member changes like roles added/removed and nicknames `role_change` - Role updates like permissions `role_create` `role_delete` `voice_change` - Voice channel join/leave `member_join` `member_left` **Requires Red 3.3+ and discord.py 1.3+** `invite_created` `invite_deleted`
fr_fr: Définir des couleurs personnalisées pour les événements du modlog `colour` doit être un code hex ou une [couleur de base.](https://discordpy.readthedocs.io/en/latest/api.html#colour) `[events...]` doit être l'une des options suivantes (plus d'un événement peut être fourni à la fois) : `channel_change` - Mise à jour du nom du salon, etc. `channel_create` `channel_delete` `commands_used` - Utilisation des commandes du Bot `emoji_change` - Ajout ou suppression d'emotes `guild_change` - Modification des paramètres du serveur `message_edit` `message_delete` `member_change` - Les changements de membres, tels que les rôles ajoutés/supprimés et les surnoms. `role_change` - Mise à jour des rôles comme des permissions `role_create` `role_delete` `voice_change` - Entrée/sortie d'un salon vocal `member_join` `member_left` **Nécessite Red 3.3+ et discord.py 1.3+** `invite_created` `invite_deleted`

source: You must provide which events should be included.
fr_fr: Vous devez indiquer les événements qui doivent être inclus.

source: {event} has been set to {colour}
fr_fr: {event} a été fixé à {colour}

source: Set modlog events to use embeds or text `<true_or_false>` The desired embed setting either on or off. `[events...]` must be any of the following options (more than one event can be provided at once): `channel_change` - Updates to channel name, etc. `channel_create` `channel_delete` `commands_used` - Bot command usage `emoji_change` - Emojis added or deleted `guild_change` - Server settings changed `message_edit` `message_delete` `member_change` - Member changes like roles added/removed and nicknames `role_change` - Role updates like permissions `role_create` `role_delete` `voice_change` - Voice channel join/leave `member_join` `member_left` **Requires Red 3.3+ and discord.py 1.3+** `invite_created` `invite_deleted`
fr_fr: Configurer les événements modlog pour qu'ils utilisent des embeds ou du texte `<true_or_false>` Le réglage de l'embed souhaité, soit activé ou désactivé. `[events...]` doit être l'une des options suivantes (plus d'un événement peut être fourni à la fois) : `channel_change` - Mise à jour du nom du salon, etc. `channel_create` `channel_delete` `commands_used` - Utilisation des commandes du Bot `emoji_change` - Ajout ou suppression d'emotes `guild_change` - Modification des paramètres du serveur `message_edit` `message_delete` `member_change` - Les changements de membres, tels que les rôles ajoutés/supprimés et les surnoms. `role_change` - Mise à jour des rôles comme des permissions `role_create` `role_delete` `voice_change` - Entrée/sortie d'un salon vocal `member_join` `member_left` **Nécessite Red 3.3+ et discord.py 1.3+** `invite_created` `invite_deleted`

source: {event} embed logs have been set to {true_or_false}
fr_fr: Les évènements {event} en format embed ont été réglés sur {true_or_false}.

source: Set the emoji used in text modlogs. `<new_emoji>` can be any discord emoji or unicode emoji the bot has access to use. `[events...]` must be any of the following options (more than one event can be provided at once): `channel_change` - Updates to channel name, etc. `channel_create` `channel_delete` `commands_used` - Bot command usage `emoji_change` - Emojis added or deleted `guild_change` - Server settings changed `message_edit` `message_delete` `member_change` - Member changes like roles added/removed and nicknames `role_change` - Role updates like permissions `role_create` `role_delete` `voice_change` - Voice channel join/leave `member_join` `member_left` **Requires Red 3.3+ and discord.py 1.3+** `invite_created` `invite_deleted`
fr_fr: Définir l'emote utilisée dans les modlogs en format textuel. `<new_emoji>` peut être n'importe quel emote discord ou emote en format unicode que le bot a accès à utiliser. `[events...]` doit être l'une des options suivantes (plus d'un événement peut être fourni à la fois) : `channel_change` - Mise à jour du nom du salon, etc. `channel_create` `channel_delete` `commands_used` - Utilisation des commandes du Bot `emoji_change` - Ajout ou suppression d'emotes `guild_change` - Modification des paramètres du serveur `message_edit` `message_delete` `member_change` - Les changements de membres, tels que les rôles ajoutés/supprimés et les surnoms. `role_change` - Mise à jour des rôles comme des permissions `role_create` `role_delete` `voice_change` - Entrée/sortie d'un salon vocal `member_join` `member_left` **Nécessite Red 3.3+ et discord.py 1.3+** `invite_created` `invite_deleted`

source: {emoji} is not a valid emoji.
fr_fr: {emoji} n'est pas un emoji valide.

source: {event} emoji has been set to {new_emoji}
fr_fr: {event} emoji a été réglé sur {new_emoji}

source: Turn on and off specific modlog actions `<true_or_false>` Either on or off. `[events...]` must be any of the following options (more than one event can be provided at once): `channel_change` - Updates to channel name, etc. `channel_create` `channel_delete` `commands_used` - Bot command usage `emoji_change` - Emojis added or deleted `guild_change` - Server settings changed `message_edit` `message_delete` `member_change` - Member changes like roles added/removed and nicknames `role_change` - Role updates like permissions `role_create` `role_delete` `voice_change` - Voice channel join/leave `member_join` `member_left` **Requires Red 3.3+ and discord.py 1.3+** `invite_created` `invite_deleted`
fr_fr: Activer et désactiver des actions spécifiques du modlog `<true_or_false>` Soit activé, soit désactivé. `[events...]` doit être l'une des options suivantes (plus d'un événement peut être fourni à la fois) : `channel_change` - Mise à jour du nom du salon, etc. `channel_create` `channel_delete` `commands_used` - Utilisation des commandes du Bot `emoji_change` - Ajout ou suppression d'emotes `guild_change` - Modification des paramètres du serveur `message_edit` `message_delete` `member_change` - Les changements de membres, tels que les rôles ajoutés/supprimés et les surnoms. `role_change` - Mise à jour des rôles comme des permissions `role_create` `role_delete` `voice_change` - Entrée/sortie d'un salon vocal `member_join` `member_left` **Nécessite Red 3.3+ et discord.py 1.3+** `invite_created` `invite_deleted`

source: {event} logs have been set to {true_or_false}
fr_fr: Les logs de {event} ont été réglées sur {true_or_false}

source: Set the channel for modlogs. `<channel>` The text channel to send the events to. `[events...]` must be any of the following options (more than one event can be provided at once): `channel_change` - Updates to channel name, etc. `channel_create` `channel_delete` `commands_used` - Bot command usage `emoji_change` - Emojis added or deleted `guild_change` - Server settings changed `message_edit` `message_delete` `member_change` - Member changes like roles added/removed and nicknames `role_change` - Role updates like permissions `role_create` `role_delete` `voice_change` - Voice channel join/leave `member_join` `member_left` **Requires Red 3.3+ and discord.py 1.3+** `invite_created` `invite_deleted`
fr_fr: Définir le salon textuel pour les modlogs. `<channel>` Le salon textuel vers lequel envoyer les événements. `[events...]` doit être l'une des options suivantes (plus d'un événement peut être fourni à la fois) : `channel_change` - Mise à jour du nom du salon, etc. `channel_create` `channel_delete` `commands_used` - Utilisation des commandes du Bot `emoji_change` - Ajout ou suppression d'emotes `guild_change` - Modification des paramètres du serveur `message_edit` `message_delete` `member_change` - Les changements de membres, tels que les rôles ajoutés/supprimés et les surnoms. `role_change` - Mise à jour des rôles comme des permissions `role_create` `role_delete` `voice_change` - Entrée/sortie d'un salon vocal `member_join` `member_left` **Nécessite Red 3.3+ et discord.py 1.3+** `invite_created` `invite_deleted`

source: {event} logs have been set to {channel}
fr_fr: {event} Les logs ont été réglées sur {}

source: Reset the modlog event to the default modlog channel. `[events...]` must be any of the following options (more than one event can be provided at once): `channel_change` - Updates to channel name, etc. `channel_create` `channel_delete` `commands_used` - Bot command usage `emoji_change` - Emojis added or deleted `guild_change` - Server settings changed `message_edit` `message_delete` `member_change` - Member changes like roles added/removed and nicknames `role_change` - Role updates like permissions `role_create` `role_delete` `voice_change` - Voice channel join/leave `member_join` `member_left` **Requires Red 3.3+ and discord.py 1.3+** `invite_created` `invite_deleted`
fr_fr: Réinitialiser un ou plusieurs événement(s) modlog pour le salon modlog défini de base. `[events...]` doit être l'une des options suivantes (plus d'un événement peut être fourni à la fois) : `channel_change` - Mise à jour du nom du salon, etc. `channel_create` `channel_delete` `commands_used` - Utilisation des commandes du Bot `emoji_change` - Ajout ou suppression d'emotes `guild_change` - Modification des paramètres du serveur `message_edit` `message_delete` `member_change` - Les changements de membres, tels que les rôles ajoutés/supprimés et les surnoms. `role_change` - Mise à jour des rôles comme des permissions `role_create` `role_delete` `voice_change` - Entrée/sortie d'un salon vocal `member_join` `member_left` **Nécessite Red 3.3+ et discord.py 1.3+** `invite_created` `invite_deleted`

source: {event} logs channel have been reset.
fr_fr: {event} Le salon des logs a été réinitialisé.

source: Turn all logging options on or off `<true_or_false>` what to set all logging settings to must be `true`, `false`, `yes`, `no`.
fr_fr: Activer ou désactiver toutes les options de logs `<true_or_false>` ce à quoi doivent correspondre tous les paramètres de journalisation doit être `true`, `false`, `yes`, `no`.

source: Toggle message edit notifications for bot users
fr_fr: Activer ou désactiver les notifications d'édition de message pour les utilisateurs de bot

source: Bots edited messages
fr_fr: Messages édités par les bots

source: enabled
fr_fr: activé

source: disabled
fr_fr: désactivé

source: Toggle message delete notifications for bot users This will not affect delete notifications for messages that aren't in bot's cache.
fr_fr: Activer/Désactiver les notifications de suppression de messages pour les utilisateurs de bot This will not affect delete notifications for messages that aren't in bot's cache.

source: Bot delete logs
fr_fr: Bot supprimer les logs

source: Delete logging settings
fr_fr: Supprimer les paramètres de logs

source: Toggle bulk message delete notifications
fr_fr: Basculer les notifications de suppression de messages en masse

source: Bulk message delete logs
fr_fr: Logs de suppression de messages en masse

source: Toggle individual message delete notifications for bulk message delete
fr_fr: Activer/Désactiver les notifications de suppression de messages individuels pour la suppression de messages groupés

source: Individual message delete logs for bulk message delete
fr_fr: Logs de suppression des messages individuels pour la suppression des messages groupés
