Repository: TrustyJAID/Trusty-cogs
Catalog: extendedmodlog/locales/*.po
Languages: fr_fr

source: Toggle message delete notifications for non-cached messages Delete notifications for non-cached messages will only show channel info without content of deleted message or its author.
fr_fr: Activer/Désactiver les notifications de suppression de message pour les messages non mis en cache Supprimer les notifications pour les messages non mis en cache ne montrera que les informations du salon sans le contenu du message supprimé ou son auteur.

source: Delete logs for non-cached messages
fr_fr: Supprimer les logs des messages non mis en cache

source: Toggle bots from being logged in user updates This includes roles and nickname.
fr_fr: Activer/Désactiver les bots pour éviter les mises à jour des utilisateurs Cela comprend les rôles et les surnoms.

source: Bots will no longer be tracked in user change logs.
fr_fr: Les bots ne seront plus suivis dans les logs de changement d'utilisateur.

source: Bots will be tracked in user change logs.
fr_fr: Les bots seront suivis dans les logs de changement d'utilisateur.

source: Toggle nickname updates for user changes
fr_fr: Changer de surnom en cas de changement d'utilisateur

source: Nicknames will no longer be tracked in user change logs.
fr_fr: Les surnoms ne seront plus suivis dans les logs des changements d'utilisateurs.

source: Nicknames will be tracked in user change logs.
fr_fr: Les pseudonymes seront suivis dans les logs des changements d'utilisateurs.

source: Set the level of commands to be logged `[level...]` must include all levels you want from: MOD, ADMIN, BOT_OWNER, GUILD_OWNER, and NONE These are the basic levels commands check for in permissions. `NONE` is a command anyone has permission to use, where as `MOD` can be `mod or permissions`
fr_fr: Définir le niveau des commandes à enregistrer `[level...]` doit comprendre tous les niveaux que vous souhaitez : MOD, ADMIN, BOT_OWNER, GUILD_OWNER, et NONE Voici les niveaux de base que les commandes vérifient dans les autorisations. `NONE` est une commande que toute personne a la permission d'utiliser, où comme `MOD` peut être `mod ou permissions`

source: Command logs set to:
fr_fr: Logs de commande réglés sur :

source: Ignore a channel from message delete/edit events and bot commands `channel` the channel or category to ignore events in
fr_fr: Ignorer un salon à partir des événements de suppression/modification de messages et des commandes de bots `` le salon ou la catégorie pour ignorer les événements dans

source: Now ignoring events in
fr_fr: En ignorant maintenant les événements de

source: is already being ignored.
fr_fr: est déjà ignorée.

source: Unignore a channel from message delete/edit events and bot commands `channel` the channel to unignore message delete/edit events
fr_fr: Ne plus ignorer un salon à partir des événements de suppression/modification de messages et des commandes de bots `` le salon ou la catégorie pour ne plus ignorer les événements dans

source: Now tracking events in
fr_fr: Suivre maintenant les événements dans

source: is not being ignored.
fr_fr: n'est plus ignoré.
